app/views/subcategories/index.html.erb

<ul>
<% Subcategory.all.each do |s| %>
---
SELECT "subcategories".* FROM "subcategories"