app/views/subcategories/show.html.erb

            <div class="col-xs-2 rank">
              <p><%= Link.all.select{|l|l.subcategory.name == @links.first.subcategory.name}.sort_by{|l| l.votes.sum(:value)}.reverse.index{|x|x.id == l.id} + 1 %></p>
---
SELECT "links".* FROM "links"
SELECT "subcategories".* FROM "subcategories"
SELECT SUM("votes"."value") FROM "votes" WHERE "votes"."link_id" = ?  [["link_id", 10]]

    <ol>
      <% User.all.sort_by{|u| u.links.count}.reverse.each do |u| %>
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "links" WHERE "links"."user_id" = ?  [["user_id", 1]]