app/views/users/show.html.erb

  <ul>
    <% @user.links.sort_by{|l| l.created_at}.each do |l| %>
---
SELECT "links".* FROM "links" WHERE "links"."user_id" = ?  [["user_id", 1]]