app/views/links/index.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."link_id" = ?  [["link_id", 1]]
---
      <div class=" col-xs-12 votes">
        <p class="text-center"><%= l.votes.count %><p>