app/views/links/index.html.erb

SELECT  "votes".* FROM "votes" WHERE "votes"."link_id" = ?  ORDER BY "votes"."id" DESC LIMIT 1  [["link_id", 4]]
SELECT SUM("votes"."value") FROM "votes" WHERE "votes"."link_id" = ?  [["link_id", 1]]
---
              <div class=" col-xs-12 votes">
                <p><%= l.votes.sum(:value) %></p>

INSERT INTO "links" ("location", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["location", "http://www.deathclock.com"], ["title", "Test"], ["user_id", 1], ["created_at", "2015-11-08 22:06:02.366231"], ["updated_at", "2015-11-08 22:06:02.366231"]]
---
            <div class="col-xs-6 author">
              <p>Submitted by <%= link_to l.user.username, user_path(id:l.user.id) %> on <%=l.created_at.strftime("%B %d\, %Y  at %I\:%M %p") %></p>

SELECT "links".* FROM "links"
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "links" WHERE "links"."user_id" = ?  [["user_id", 1]]
---
    <ol>
      <% User.all.sort_by{|u| u.links.count}.reverse.each do |u| %>