app/views/links/new.html.erb

    <%= f.label :user_id, class: "col-xs-2 col-xs-offset-1" %>
    <%= collection_select(:link, :user_id, User.all, :id, :username, prompt: true) %>
---
SELECT "links".* FROM "links"
SELECT "users".* FROM "users"