app/views/links/new.html.erb

SELECT "subcategories".* FROM "subcategories"
---
    <%= f.label :subcategory_id, class: "col-xs-2 col-xs-offset-1" %>
    <%= collection_select(:link, :subcategory_id, Subcategory.all, :id, :name, prompt: true) %>