app/views/links/show.html.erb

SELECT SUM("votes"."value") FROM "votes" WHERE "votes"."link_id" = ?  [["link_id", 1]]
---
      <div class=" col-xs-12 votes">
        <p><%= @link.votes.sum(:value) %><p>