app/controllers/links_controller.rb

SELECT  "votes".* FROM "votes" WHERE "votes"."link_id" = ?  ORDER BY "votes"."id" DESC LIMIT 1  [["link_id", 4]]
SELECT "links".* FROM "links"
SELECT SUM("votes"."value") FROM "votes" WHERE "votes"."link_id" = ?  [["link_id", 1]]
---
  def index
    @links = Link.all.sort_by{|l| l.votes.sum(:value)}.reverse

SELECT "links".* FROM "links"
SELECT SUM("votes"."value") FROM "votes" WHERE "votes"."link_id" = ?  [["link_id", 1]]
INSERT INTO "links" ("subcategory_id", "location", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["subcategory_id", 2], ["location", "http://www.lilly.com"], ["title", "test post"], ["user_id", 2], ["created_at", "2015-11-08 19:15:26.227005"], ["updated_at", "2015-11-08 19:15:26.227005"]]
---
  def create
    @links = Link.all.sort_by{|l| l.votes.sum(:value)}.reverse
    @link = Link.new(link_params)
      unless @link.location[/\Ahttp:\/\//] || @link.location[/\Ahttps:\/\//]
      @link.location = "http://"+@link.location
    end
    if Link.all.any?{|l|l.location == @link.location}
      redirect_to existing_link_vote_path(link_id:Link.all.select{|l|l.location == @link.location}.first.id)
    else
      if @link.save

SELECT SUM("votes"."value") FROM "votes" WHERE "votes"."link_id" = ?  [["link_id", 1]]
INSERT INTO "votes" ("link_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["link_id", 10], ["value", 1], ["created_at", "2015-11-08 22:34:37.449968"], ["updated_at", "2015-11-08 22:34:37.449968"]]
SELECT "links".* FROM "links"
---
  def vote
    vote = Vote.new(vote_params)
    vote.value=-1 if params[:downvote]
    vote.save
    @links = Link.all.sort_by{|l| l.votes.sum(:value)}.reverse

SELECT "links".* FROM "links"
SELECT SUM("votes"."value") FROM "votes" WHERE "votes"."link_id" = ?  [["link_id", 1]]
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 10]]
---
  def show
    @links = Link.all.sort_by{|l| l.votes.sum(:value)}.reverse
    @link = Link.find(params['id'])

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "links" SET "title" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["title", ""], ["updated_at", "2015-11-07 04:53:30.963390"], ["id", 3]]
---
  def update
    @link = Link.find(params[:id])
    unless @link.location[/\Ahttp:\/\//] || @link.location[/\Ahttps:\/\//]
      @link.location = "http://"+@link.location
    end
    if @link.update(link_params)

SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 11]]
---
  def destroy
    @link = Link.find(params[:id])
    @link.destroy