app/controllers/links_controller.rb

SELECT "users".* FROM "users"
---
  def create
    @link = Link.new(link_params)
    @link.user = current_user
    @link.confirm_web_address
    if Link.all.exists?(location: @link.location)

SELECT "users".* FROM "users"
---
  def vote
    if current_user
      @vote = Vote.new(vote_params)
      @vote.user = current_user
      @vote.value=-1 if params[:downvote]