app/controllers/subcategories_controller.rb

  def create
    @subcategory = Subcategory.new(subcategory_params)
    @subcategory.user_id = current_user
    if @subcategory.save
      @links = Link.all.select{|l| l.subcategory_id == @subcategory.id}.sort_by{|l| l.votes.sum(:value)}.reverse.paginate(:page => params[:page], :per_page => 10)
---
INSERT INTO "subcategories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "tester"], ["created_at", "2015-11-09 02:45:31.326564"], ["updated_at", "2015-11-09 02:45:31.326564"]]
SELECT "links".* FROM "links"
SELECT "subcategories".* FROM "subcategories"

  def vote
    Vote.create(vote_params)
    @subcategory = Subcategory.all.select{|s| s.name.downcase==params['name'].downcase}.first
    @links = Link.all.select{|l| l.subcategory_id == @subcategory.id}.sort_by{|l| l.votes.sum(:value)}.reverse.paginate(:page => params[:page], :per_page => 10)
---
INSERT INTO "votes" ("link_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["link_id", 10], ["value", 1], ["created_at", "2015-11-08 22:39:49.860587"], ["updated_at", "2015-11-08 22:39:49.860587"]]
SELECT "subcategories".* FROM "subcategories"
SELECT "links".* FROM "links"
SELECT SUM("votes"."value") FROM "votes" WHERE "votes"."link_id" = ?  [["link_id", 1]]

  def edit
    sub =Subcategory.all.select{|s| s.name.downcase==params['name'].downcase}.first
---
SELECT "subcategories".* FROM "subcategories"

  def show
    @subcategory =Subcategory.all.select{|s| s.name.downcase==params['name'].downcase}.first
    @links = Link.all.select{|l| l.subcategory_id == @subcategory.id}.sort_by{|l| l.votes.sum(:value)}.reverse.paginate(:page => params[:page], :per_page => 10)
---
SELECT "subcategories".* FROM "subcategories"
SELECT "links".* FROM "links"
SELECT SUM("votes"."value") FROM "votes" WHERE "votes"."link_id" = ?  [["link_id", 10]]