app/controllers/users_controller.rb

INSERT INTO "users" ("username", "name", "aboutme", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "BenFair"], ["name", "Ben Fair"], ["aboutme", "Ben is also a twin"], ["created_at", "2015-11-07 04:30:19.682226"], ["updated_at", "2015-11-07 04:30:19.682226"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @user = User.find(params['id'])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @user = User.find(params['id'])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @user= User.find(params['id'])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def destroy
    @user= User.find(params['id'])
    @user.destroy