app/controllers/votes_controller.rb

  def create
    vote = Vote.create(vote_params)
---
INSERT INTO "votes" ("link_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["link_id", 10], ["value", 1], ["created_at", "2015-11-07 04:48:41.817030"], ["updated_at", "2015-11-07 04:48:41.817030"]]

  def use_link
    @vote = Vote.create(vote_params)
---
INSERT INTO "votes" ("link_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["link_id", 9], ["value", 1], ["created_at", "2015-11-07 05:05:34.943008"], ["updated_at", "2015-11-07 05:05:34.943008"]]

  def existing_link_vote
    @vote = Vote.create(vote_params)
---
INSERT INTO "votes" ("link_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["link_id", 8], ["value", 1], ["created_at", "2015-11-07 06:26:41.277210"], ["updated_at", "2015-11-07 06:26:41.277210"]]

  def destroy
    vote = Vote.find(params[:id])
    vote.destroy
---
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 7]]